#### ConnectorManager Members

---

|  |
| --- |
| ConnectorManager Class   Methods   Properties   See Also |

The  ConnectorManager  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  ConnectorManager |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | Lookup | Lookup the connector using the unique index value that identify this connector. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Connectors | Return all the Connectors of the Connector Manager. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | Owner | This property is used to retrieve the owner of the Connector Manager. |
| Public property | UnusedConnectors | Return all the unused Connectors of the Connector Manager. |

# See Also

ConnectorManager Class

Autodesk.Revit.DB Namespace